
数据库调优教程（九）添加了索引但不被使用的几种常见可能


三、索引

6.添加了索引但不被使用的几种常见可能

上一讲聊了什么时候不要使用索引，但有时候使用了也不见得会被使用。
下面是几种添加了索引但不被使用的情况


1)多列索引查询条件没有使用最左边的字段
对于创建的多列索引，如果查询条件没有使用最左边的列，索引就不会被使用。
多列索引：一个索引对应多个列
比如
我创建了这么个多列索引
[plain] view plain copy
create index index_deptno_loc on dept (deptno,loc);

如果where语句中有deptno则会使用索引，否则不使用

2)如果条件中有or
只要条件中有一个字段没有添加索引，则不会使用索引

3)类型不对应
比方说，如果列类型是字符串，那一定要在条件中将数据使用引号引用起来。否则不使用索引

4)MySQL优化器的决定
如果mysql估计使用全表扫描要比使用索引快，则不使用索引


最后一点，也是笔者感受最深的一点


5)    like‘%aaa’不会使用到索引
只要模糊查询的模糊值在字符串前面，则不会使用索引‘%aaa’和‘_aaa’都不会！
如下


应该说这是Mysql给程序员们开的一个玩笑。要是我的表数据量很大，而且又需要使用like’%%’这样的模糊查询来检索时，该怎么办？？




-----------------------------

7.解决like’%str’不使用模糊查询的4种方法

上一讲最后说了，只要模糊查询的模糊值在字符串前面，则不会使用索引，‘%aaa’和‘_aaa’都不会！
如下

应该说这是MySQL给程序员们开的一个玩笑。要是我的表数据量很大，而且又需要使用like’%%’这样的模糊查询来检索时，该怎么办？？
接下来，笔者将会给大家分享解决这个问题的四种方法！

1)    Select主键
只要Select的字段刚好是主键，那么就会使用到索引(只对innodb数据库有效)
比如下面的
[plain] view plain copy
select idfrom emp where ename like '%haha%'\G

就使用了索引

[plain] view plain copy
select * from empwhere ename like '%haha%'\G

则不使用索引


除了主键，其他字段必须设置为覆盖索引才能使索引生效，不能单独设置索引
比如下面这种是不会使用索引的

可以采用分步查询的方法，先select主键再利用主键去找其他字段。不过好像比较麻烦！别怕！接下来会讲一种最优方法——覆盖索引法！

2)    覆盖索引法
覆盖索引是一种特殊的多列索引，当多列索引指向一个查询语句中所有的字段时，该多列索引就被称为覆盖索引。
使用覆盖索引可以解决问题！
创建覆盖索引


当然，如果你想要select很多字段甚至是select*，那你可以创建一个多列索引指向所有字段（innodb可以不指向主键）


注意：
笔者发现，当覆盖索引指向的字段是varchar(380)及380以上的字段时，覆盖索引会失效！

3)    全文索引法
此方法有较大局限。
全文索引，只对MyISAM引擎有用。主要是针对对文件，文本的检索, 比如文章或者段落,.
它会把某个数据表的某个数据列出现过的所有单词生成一份清单
少于3个字符的单词不会被包含在全文索引里，可以通过修改my.cnf修改选项
ft_min_word_len=3
但是！
全文索引不完全等同于模糊查询
比如title字段有这么个数据’abcd20088ccaa’,使用模糊查询select * from articles wheretitle like’%2008%’可以查找到，而使用全文检索select * from articles where match(title) against(‘2008’);是检索不到的，因为2008不是一个单词！

4)  使用全文检索引擎工具包
采用lucene、Sphinx、solr等专门的全文检索开源工具可以检索某段字符串。
